<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Дизайн Интерьера</title>
    <link rel="stylesheet" href="css/main.css">
    <link rel="stylesheet" href="javas/skript.js">
</head>
<body>

<header>
        <a href="index.php"><div class="logo">Дизайн Интерьера</div></a>
        <nav>
            <ul>
                <li><a href="about.php">О нас</a></li>
                <li><a href="services.php">Услуги</a></li>
                <li><a href="portfolio.php">Портфолио</a></li>
                <li><a href="contact.php">Контакты</a></li>
                <li><a href="indexx.php">Регистрация</a></li>
            </ul>
        </nav>
    </header>

    <section class="intro">
        <div class="slider">
            <div class="slide" style="background-image: url('хай-тек1');"></div>
            <div class="slide" style="background-image: url('https://via.placeholder.com/1500x800?text=Фото+2');"></div>
            <div class="slide" style="background-image: url('https://via.placeholder.com/1500x800?text=Фото+3');"></div>
        </div>
        <h1>Создайте идеальный интерьер с нами</h1>
        <p><i>Мы создаем интерьеры, которые идеально соответствуют вашему стилю жизни, подчеркивая индивидуальность каждого пространства. Мы тщательно подходим к каждой детали, чтобы создать пространство, которое не только будет красивым, но и удобным.</p></i>
    </section>
 
  

        <section id="portfolio" class="portfolio">
            <h2>минимализм</h2>
            <div class="gallery">
                <img src="img/минимализм1.jpeg" alt="Проект 1">
                <img src="img/минимализм2.jpeg" alt="Проект 2">
                <img src="img/минимализм3.jpeg" alt="Проект 3">
                <img src="img/минимализм4.jpeg" alt="Проект 3">
                <img src="img/минимализм5.jpeg" alt="Проект 3">
            </div>
            <div class="description">
        <h3>Минимализм</h3>
        <p>Минимализм — это стиль, основанный на простоте и функциональности, с минимальными декоративными элементами. Здесь акцент ставится на пространство, чистые линии и нейтральные цвета.</p>
        <p><strong>Особенности минимализма:</strong> Светлые, нейтральные оттенки, простые материалы, минимум декора, функциональная мебель, светлое освещение.</p>
        <p><strong>Идеально для:</strong> Людей, предпочитающих спокойствие и порядок.</p>
    </div>

        </section>
  

    <section id="portfolio" class="portfolio">
        <h2>индастриал</h2>
        <div class="gallery">
            <img src="img/индастриал.jpeg" alt="Проект 1">
            <img src="img/индастриал1.jpeg" alt="Проект 2">
            <img src="img/индастриал 2.jpeg" alt="Проект 3">
            <img src="img/индастриал 3.jpeg" alt="Проект 3">
        </div>
        <div class="description">
            <h3>Инстайл</h3>
            <p>Инстайл — это стиль, вдохновленный актуальными трендами и модными направлениями в дизайне. Он гибкий и сочетает элементы различных стилей, оставаясь современным и "в тренде".</p>
            <p><strong>Особенности инстайла:</strong> Современные и экологичные материалы, яркие акценты, модные аксессуары и дизайнерские светильники.</p>
            <p><strong>Идеально для:</strong> Людей, следящих за трендами и желающих, чтобы их интерьер был актуальным и стильным.</p>
        </div>
    </div>
    </section>

    <section id="portfolio" class="portfolio">
        <h2>лофт</h2>
        <div class="gallery">
            <img src="img/лофт 1.jpeg" alt="Проект 1">
            <img src="img/лофт2.jpeg" alt="Проект 2">
            <img src="img/лофт3.jpeg" alt="Проект 3">
            <img src="img/лофт4.jpeg" alt="Проект 3">
        
        </div>
        <div class="description">
            <h3>Лофт</h3>
            <p>Лофт — это стиль, который появился в 1950-е годы в Нью-Йорке, когда заброшенные фабрики и склады превращались в жилые помещения. Характеризуется открытым пространством и индустриальными элементами.</p>
            <p><strong>Особенности лофта:</strong> Бетон, кирпич, металл, стекло, простая и функциональная мебель. Высокие потолки и открытые балки.</p>
            <p><strong>Идеально для:</strong> Просторных помещений с высокими потолками, для людей, которые ценят творческую атмосферу.</p>
        </div>
</div>
    </section>

    <section id="portfolio" class="portfolio">
        <h2>хай-тек</h2>
        <div class="gallery">
            <img src="img/хай-тек 1.jpeg" alt="Проект 1">
            <img src="img/хай-тек 2.jpeg" alt="Проект 2">
            <img src="img/хай-тек3.jpeg" alt="Проект 3">
            
        </div>
        <div class="description">
            <h3>Хай-тек</h3>
            <p>Хай-тек — стиль, в основе которого лежат передовые технологии, промышленный стиль и использование инновационных материалов. Это современный и футуристический подход к дизайну интерьера.</p>
            <p><strong>Особенности хай-тека:</strong> Холодные оттенки, такие как серебристый, белый, черный, металл и стекло. Минимум декоративных элементов.</p>
            <p><strong>Идеально для:</strong> Современных интерьеров, людей, любящих технологии и футуризм.</p>
        </div>
    </div>
    </section>

    <section id="portfolio" class="portfolio">
    <h2>Ранчо</h2>
    <div class="gallery">
        <img src="img/ранчо1.jpeg" alt="Проект 1">
        <img src="img/ранчо2.jpeg" alt="Проект 2">
        <img src="img/ранчо3.jpeg" alt="Проект 3">
        <img src="img/ранчо4.jpeg" alt="Проект 4">
    
    </div>
    <div class="description">
        <h3>Ранчо</h3>
        <p>Стиль "Ранчо" сочетает элементы американского сельского интерьера с комфортом и функциональностью. Он отражает атмосферу простоты и уюта, где дом соединяется с природой.</p>
        <p><strong>Особенности стиля Ранчо:</strong> Теплые нейтральные оттенки, дерево, камень, кожа и металлические элементы. Простой и прочный декор, а также удобная и функциональная мебель.</p>
        <p><strong>Идеально для:</strong> Любителей природы, уюта и традиционного американского стиля. Этот стиль подойдет для загородных домов и просторных квартир.</p>
    </div>
</section>


<section id="portfolio" class="portfolio">
    <h2>Ар Деко</h2>
    <div class="gallery">
        <img src="img/ардееко1.jpeg" alt="Проект 1">
        <img src="img/ардееко2.jpeg" alt="Проект 2">
        <img src="img/ардееко3.jpeg" alt="Проект 3">
        <img src="img/ардееко4.jpeg" alt="Проект 4">
        <img src="img/ардееко5.jpeg" alt="Проект 5">
    </div>
    <div class="description">
        <h3>Ар Деко</h3>
        <p>Ар Деко — это стиль, который появился в 1920-1930-х годах и представляет собой роскошь, геометрические формы, яркие цвета и экзотические материалы. Это сочетание элегантности и функциональности, характерное для времени между мировыми войнами.</p>
        <p><strong>Особенности стиля Ар Деко:</strong> Яркие и насыщенные цвета, геометрические узоры, использование дорогих материалов, таких как мрамор, металл, стекло и экзотические породы дерева. Мебель часто отличается четкими линиями и роскошными отделками.</p>
        <p><strong>Идеально для:</strong> Людей, ценящих элегантность и роскошь, а также любителей уникальных и запоминающихся интерьеров. Ар Деко идеально подходит для городских квартир, а также для роскошных домов и отелей.</p>
    </div>
</section>


<section id="portfolio" class="portfolio">
    <h2>Дзен</h2>
    <div class="gallery">
        <img src="img/дзен1.jpeg" alt="Проект 1">
        <img src="img/дзен2.jpeg" alt="Проект 2">
        <img src="img/дзен3.jpeg" alt="Проект 3">
        <img src="img/дзен4.jpeg" alt="Проект 4">
        <img src="img/дзен5.jpeg" alt="Проект 5">
    </div>
    <div class="description">
        <h3>Дзен</h3>
        <p>Дзен — это стиль, который акцентирует внимание на гармонии, минимализме и внутреннем спокойствии. Он ориентирован на создание расслабляющей атмосферы, используя натуральные материалы и простые формы.</p>
        <p><strong>Особенности стиля Дзен:</strong> Природные материалы (дерево, камень, бамбук), простота форм и функциональность. Цветовая палитра обычно включает мягкие нейтральные оттенки, такие как белый, бежевый и серый, а также зеленые и коричневые акценты. Интерьер часто включает растения, элементы воды и мягкое освещение, создавая ощущение спокойствия и уединения.</p>
        <p><strong>Идеально для:</strong> Людей, которые ищут гармонию, внутренний баланс и стремятся к спокойной, умиротворяющей атмосфере в своем доме.</p>
    </div>
</section>


<section id="portfolio" class="portfolio">
    <h2>Магазин в стиле Минимализм</h2>
    <div class="gallery">
        <img src="img/магазин1 (1).jpeg" alt="Проект 1">
        <img src="img/магазин1 (2).jpeg" alt="Проект 2">
        <img src="img/магазин1 (3).jpeg " alt="Проект 3">
        <img src="img/магазин1 (4).jpeg " alt="Проект 4">
    </div>
    <div class="description">
        <h3>Магазин в стиле Минимализм</h3>
        <p>Магазины в стиле минимализм создают чистую и упорядоченную атмосферу, где каждый элемент имеет свою цель и функциональность. Здесь акцент на простоте, открытом пространстве и отсутствие лишних деталей, что позволяет покупателю сосредоточиться на товаре.</p>
        <p><strong>Особенности стиля:</strong> Просторные, светлые помещения с нейтральной цветовой палитрой (белый, серый, черный). Мебель минимальна, часто используются гладкие поверхности, металлы и стекло. Оформление интерьера ограничивается минимальными декорациями и акцентами, чтобы не перегружать пространство.</p>
        <p><strong>Идеально для:</strong> Магазинов, которые хотят создать атмосферу простоты и элегантности, где важна функциональность, а не количество декоративных элементов. Подходит для бутиков, дизайнерских магазинов, магазинов мебели и аксессуаров.</p>
    </div>
</section>

    <footer>

    
        <p>&copy; 2025 Дизайн Интерьера</p>
    </footer>

    <script src="scripts.js"></script>
</body>
</html>